copyText("1");
runPackage("com.taobao.etao",15000);

//click(352,667,"签到领钱",15000);
click(355,472,"签到领钱",15000);

click(356, 292, "点我签到");

sleep(5000);
click(356, 292, "点我签到");
sleep(10000);

back();

sleep(3000);

click(217,473,"0元抽",15000);
//click(218,669,"0元抽",15000);

click(583, 411, "立即0元抽",15000);

click(188, 608, "立即0元抽",10000);

click(349, 736, "分享抽奖",3000);

back(2);

sleep(3000);

click(583, 411, "立即0元抽",15000);

click(188, 608, "立即0元抽",5000);

/*
click(630, 1222, "我的 标签");
sleep(10000);

click(230, 973, "签到领积分卡");

sleep(10000);
click(356, 292, "点我签到");

sleep(5000);
click(356, 292, "点我签到");
sleep(10000);

click(201, 651, "今日0元抽");
sleep(10000);
click(583, 411, "立即0元抽");
sleep(10000);
click(188, 608, "立即0元抽");
sleep(8000);
click(349, 736, "分享抽奖");
sleep(3000);
click(123,1098,"淘口令",15000);
click(188, 608, "立即0元抽");
copyText("1");

// sleep(10000);

// exit(true);

*/